{
    "last": "current", 
    "all_tags": [
        "0.4.24", 
        "0.4.17", 
        "0.4.16", 
        "0.4.15", 
        "0.4.14", 
        "0.4.13", 
        "0.4.12", 
        "0.4.11", 
        "0.4.10", 
        "0.4.9"
    ], 
    "changelog": {
        "current": {
            "fecha": "", 
            "tag": "current", 
            "changelog": []
        }, 
        "0.4.24": {
            "fecha": "2015-05-26-", 
            "tag": "0.4.24", 
            "changelog": [
                "Arreglada la capa de dibujo (no recibía eventos)", 
                "Actualizando el paquete.", 
                "Actualizando version.", 
                "Actualizando version.", 
                "Actualizando el tamano de ventana.", 
                "Agregada la dependencia bluebird para el empaquetado y cambiada la  versión.", 
                "Changelog.", 
                "Quitado el bitrate de salida para evitar errores exportando con un fps  bajo.", 
                "Corregida llamada a avconv, ahora genera un video con los fps  correctos.", 
                "Changelog.", 
                "Agregada la dependencia: bluebird.", 
                "Agragando opción al avconv.", 
                "Esperando a que se graben las imágenes antes de exportar el video. ", 
                "Quitada una dependencia y actualizado el changelog.", 
                "Quitada la dependencia fluent-ffmpeg.", 
                "Quitada la dependencia de ffmpeg.", 
                "Reemplazada fluent-ffmpeg por un mock que usa avconv.", 
                "Subiendo el archivo bower.json.", 
                "Actualizando paquete.", 
                "Actualizando changelog.", 
                "Actualizando paquete.", 
                "Actualizando la url de consulta al ws de versiones.", 
                "Reparando rutas para el componente version.", 
                "Agregando consulta de última versión a través de un webservice.", 
                "Actualizando paquete.", 
                "Release 0.4.17."
            ]
        }, 
        "0.4.17": {
            "fecha": "2015-02-18-", 
            "tag": "0.4.17", 
            "changelog": [
                "Reparando la exportacion de videos.", 
                "Arreglos para evitar que se arrastren imágenes o se puedan soltar  archivos sobre la ventana de nodewebkit.", 
                "Quitando armado de thumbnails.", 
                "Simplificando la directiva huayra-version.", 
                "Actualizando paquete.", 
                "Release 0.4.16."
            ]
        }, 
        "0.4.16": {
            "fecha": "2015-01-07-", 
            "tag": "0.4.16", 
            "changelog": [
                "Quitando animaciones de los diálogos.", 
                "Cambiando el zindex.", 
                "Actualizando.", 
                "Release 0.4.15."
            ]
        }, 
        "0.4.15": {
            "fecha": "2015-01-07-", 
            "tag": "0.4.15", 
            "changelog": [
                "Arreglo menor.", 
                "Release 0.4.14."
            ]
        }, 
        "0.4.14": {
            "fecha": "2015-01-07-", 
            "tag": "0.4.14", 
            "changelog": [
                "Ordenando numero de versiones.", 
                "Organizando archivos.", 
                "Quitando la dependencia de bower.", 
                "Release 0.4.13."
            ]
        }, 
        "0.4.13": {
            "fecha": "2015-01-07-", 
            "tag": "0.4.13", 
            "changelog": [
                "Arreglo menor.", 
                "Comenzando a modularizar componentes.", 
                "Release 0.4.12."
            ]
        }, 
        "0.4.12": {
            "fecha": "2015-01-07-", 
            "tag": "0.4.12", 
            "changelog": [
                "Arreglo menor.", 
                "Agregando manejador de argumentos para abrir proyectos directamente  desde consola.", 
                "Corrigiendo mime type (no usar text/*** porque la busqueda del icono  termina buscando text-generic por todos los temas)", 
                "El archivo debe llevar el nombre del paquete.", 
                "Correccion del formato del archivo control y dependencias.", 
                "Soporte de mime y asociacion para los archivos .hmotion.", 
                "Actualizando changelog.", 
                "Release 0.4.11."
            ]
        }, 
        "0.4.11": {
            "fecha": "2015-01-05-", 
            "tag": "0.4.11", 
            "changelog": [
                "Agregando un notificador de versión.", 
                "Actualizando changelog.", 
                "Release 0.4.10."
            ]
        }, 
        "0.4.10": {
            "fecha": "2015-01-05-", 
            "tag": "0.4.10", 
            "changelog": [
                "Generando comandos para automatizar releases."
            ]
        }, 
        "0.4.9": {
            "fecha": "2014-12-22", 
            "tag": "0.4.9", 
            "changelog": [
                "Quitando soporte para exportar a mpeg2.", 
                "Reparando el bug de escalado de gif.", 
                "Reparando el problema de exportacion de  GIF.", 
                "Escondo el paginador.", 
                "Un cartelito un poco mas practico para reportar errores de videos-no html5.", 
                "Mejore un poquito el manejo para verificar si tenemos cam o no. ", 
                "Saco alerts y consolelogs.", 
                "Soporta multiples camaras en red. MODO DEBUG, NO PRODUCCION.", 
                "Agrego carita del mensaje de error.", 
                "Si no tenemos camara o la camara no funciona, nos notifica al iniciar  la aplicacion.", 
                "Changelog.", 
                "Merge pull request #5 from digitalh/master.", 
                "Merge pull request #4 from digitalh/master.", 
                "Actualizando paquete debian.", 
                "Reparando el bug de las imágenes que aparecían por la mitad.", 
                "Comenzando a implementar promesas en lugar de callbacks.", 
                "Actualizando async.", 
                "Deshabilitando los selectores de capas anterior y siguiente.", 
                "Arreglando el problema del cache de imagenes.", 
                "Arreglo en la copia de archivos.", 
                "Merge branch 'master' of https://github.com/HuayraLinux/huayra stopmotion.", 
                "Actualizando paquete.", 
                "Arreglo menor.", 
                "Actualizando paquete debian.", 
                "Merge branch 'master' of https://github.com/HuayraLinux/huayra stopmotion.", 
                "Merge branch 'master' of https://github.com/HuayraLinux/huayra stopmotion.", 
                "Merge branch 'master' of https://github.com/HuayraLinux/huayra stopmotion.", 
                "Merge branch 'master' of https://github.com/HuayraLinux/huayra stopmotion.", 
                "Actualizando paquete debian.", 
                "Arreglando el dibujado con webcams de poca resolucion.", 
                "Log de prueba.", 
                "Creando efectos para espejar el video en vivo.", 
                "Agregando imagen al modo cámara remota.", 
                "Agregando modo dibujado sobre el canvas.", 
                "Merge branch 'master' of https://github.com/HuayraLinux/huayra stopmotion.", 
                "Ocultando la capa de cebolla cuando no hay cuadros en la animación. ", 
                "Reparando el modo cámara remota.", 
                "Borrando archivos que ya no se usan.", 
                "Actualizando paquete debian.", 
                "Quitando la etiqueta \"modo\" y agregando un texto explicando como usar  la cámara compartida.", 
                "Evitando que se pueda seleccionar texto en la interfaz.", 
                "Merge branch 'master' of https://github.com/HuayraLinux/huayra stopmotion.", 
                "Reparando el bug que se producía al exportar proyectos en directorios  con espacios.", 
                "Haciendo que los links de la sección About abran el navegador.", 
                "Merge branch 'master' of http://github.com/HuayraLinux/huayra stopmotion.", 
                "Probando la invocacion directa a uvccapture.", 
                "Probando parámetros de configuración para la cámara.", 
                "Probando camelot dentro del handler de error de camera.", 
                "Actualizando dependencias para instalar fswebcam, binario que necesita  camelot para usar la webcam en tangopoint.", 
                "Agregando mensajes de error cuando no se detecta la cámara.", 
                "Arreglo menor. bower hay que instalarlo global.", 
                "Mejorando las instrucciones de instalacion.", 
                "Merge branch 'master' of https://github.com/HuayraLinux/huayra stopmotion.", 
                "Agregando camelot a la lista de dependencias.", 
                "Mejorando el menú de captura de cuadros con temporizador.", 
                "Agregando soporte para exportar GIF, reproduciendo un sonido al borrar  y creando el dialogo \"acerca de ...\"", 
                "Borrando capas que ya no se usaban.", 
                "Agregando un cuadro de dialogo para la opción \"acerca de ...\"", 
                "Mejorando la animación de explosión.", 
                "Agregando animación a la eliminación de cuadros y sincronizando la  emisión de cuadros cuando se usa la cámara remota.", 
                "Mejorando el estilo del cuadro actual.", 
                "Haciendo una pausa cuando se captura entre cuadro y cuadro.", 
                "Agregando animaciones cuando se elimina o genera un cuadro.", 
                "Actualizando archivo ignore.", 
                "Reparando la acción \"guardar\".", 
                "Convirtiendo el menú en un servicio de angulars.", 
                "Arreglo menor en la lista de proyectos recientes.", 
                "Haciendo mas visible el cuadro de animación seleccionado.", 
                "Mejorando la pantalla principal.", 
                "Mejorando el circuito de carga de proyecto y guardado.", 
                "Guardando las imágenes de un proyecto en curso con _ al principio. ", 
                "Colocando \"sin titulo\" en la ventana cuando el proyecto es nuevo. ", 
                "Exportando la animación respetando los FPS definidos.", 
                "Implementando la generación de vídeo (ahora funciona con mp4!)", 
                "Implementación inicial de la generación de videos usando ffmpeg.", 
                "Comenzando a implementar el dialogo para exportar videos.", 
                "Agregando dialogo modal para capturar el cierre de la ventana.", 
                "Implementando guardado de proyectos y título de la ventana indicando  estado guardado.", 
                "Métodos agregados a la clase proyecto: abrir, agregar y guardar  cuadro.", 
                "Creando el servicio Proyecto.", 
                "Creando el dialogo modal de confirmación al cerrar proyecto.", 
                "Creando varias de proyecto para el flujo inicial.", 
                "Moviendo código de paneles al nuevo servicio Paneles.", 
                "Clase Preferencias se pasó a un Service de Angular.", 
                "Comenzando a modularizar el código relativo a los paneles.", 
                "Mejorando el modulo menú para que exporte una clase como el módulo  preferencias.", 
                "Modularizando livereload.", 
                "Identando app.js.", 
                "Modularizando filtros y el menú principal.", 
                "Agregando modo estricto a preferencias.", 
                "Identando el archivo índex.html.", 
                "Modularizando Preferencias.", 
                "Comenzando a implementar el dialogo para exportar vídeos.", 
                "Cambiando el ícono de borrar cuadro.", 
                "Leer cuadros/imágenes desde la ruta relativa al proyecto.", 
                "La carpeta de imágenes de proyecto ahora lleva el mismo nombre que el  proyecto.", 
                "Merge branch 'master' of github.com:HuayraLinux/huayra-stopmotion. ", 
                "Colocando un spinner de prueba a la lista de proyectos.", 
                "Mostrar sólo el nombre de archivo.", 
                "Link para abrir proyectos recientes.", 
                "Re-armado de lógica para guardar proyectos.", 
                "Arreglo del serializador de JSON.", 
                "Clase para manejo de preferencias Guardado de proyectos recientes. ", 
                "Definiendo la ruta de instalacion de los modulos bower.", 
                "Cambiando la ruta de angular-ui porque no estaba cargando.", 
                "Arreglando la URL para acceder a compartir la cámara.", 
                "Actualizando el ícono de la aplicación.", 
                "Merge branch 'master' of https://github.com/HuayraLinux/huayra stopmotion.", 
                "Actualizando la informacion para generar el paquete de huayra.", 
                "Arreglos menores al generar el paquete.'", 
                "Actualizando scripts de empaquetado.", 
                "Actualizando script para generar el paquete.", 
                "Poniendo un límite de 30 cuadros por segundos como máximo.", 
                "Arreglos menores.", 
                "Modificando el atajo para abrir las herramientas de desarrollo. Ahora  no requiren de angulars.", 
                "Merge branch 'master' of https://github.com/HuayraLinux/huayra stopmotion.", 
                "Agregando un botón para abrir las herramientas de desarrollo desde la  pantalla principal..", 
                "Agregando script para instalar dependencias y angular-ui-bootstrap bower.", 
                "Implementando acceso remoto.", 
                "Mejorando el modo remoto para que arme una URL con el hostname y el  puerto.", 
                "Agregando opción para reproducir video y controles para controlar los  cuadros por segundo.", 
                "Haciendo que el cuadro de animación nuevo aparezca a la derecha del  cuadro actual.", 
                "Agregando opción para exportar video en el menú tradicional.", 
                "Cambiando la tecla \"backspace\" por \"x\"", 
                "Agregando un botón a la izquierda de cada cuadro para que se puedan  borrar cuadros de animación.", 
                "Agregando atajo de teclado para borrar el cuadro actual.", 
                "Quitando los dos paneles que no se utilizaban y agregando opción para  salir desde el menú.", 
                "Arreglos menores en la estructura html.", 
                "Reparando el bug del tamaño de las imágenes usando una webcam.", 
                "Agregando la opción 'abrir' en la barra de menú principal.", 
                "Implementando carga de archivos.", 
                "Implementando guardar proyecto.", 
                "Adaptando los layers para que se ajusten al tamaño del contenedor. ", 
                "Instalando dependencias faltantes.", 
                "Haciendo configurable el acceso remoto.", 
                "Implementación inicial para compartir camara.", 
                "Agregando tab para previsualizar la animación.", 
                "Comenzando a implementar el dialogo para abrir proyectos y haciendo  que el cuadro cebolla sea siempre el cuadro seleccionado.", 
                "Mejorando el asistente inicial y modificando los atajos para avanzar  de cuadro y reiniciar.", 
                "Quitando barras de scroll en el contenedor de video.", 
                "Reparando el tamaño de las capas sobre el video para que se ajusten  automáticamente.", 
                "Implementando livereload.", 
                "Haciendo que la grilla sea semi invisible al principio.", 
                "Instalando gaze para que la aplicacion soporte livereload.", 
                "Quitando referencias a google fonts.", 
                "Mejorando la pantalla de ayuda.", 
                "Agregando una captura de pantalla nueva.", 
                "Deshabilitando live-reload para hacer el deploy.", 
                "Reparando el overlay de grilla con filas y columnas.", 
                "Agregando un botón para mostrar u ocultar la ayuda.", 
                "Mejorando la pantalla inicial.", 
                "Comenzando a crear el asistente inicial en reemplazo del panel de  carga inicial.", 
                "Agregando un botón para mostrar u ocultar el panel lateral.", 
                "Agregando livereload.", 
                "Agregando un fondo al selector de paginas en la linea de tiempo.", 
                "Comenzando a crear la capa de grilla con filas y columnas variables. ", 
                "Reemplazando slides angular por slides traducionales y moviendo el  deslizador de capa cebolla a otra sección.", 
                "Mostrando los links de descarga en el archivo makefile.", 
                "Automatizando la forma de subir versiones nuevas al servidor.", 
                "Mejorando el archivo README.", 
                "Arreglos menores en los tabs.", 
                "Adaptando el tamaño de la ventana principal.", 
                "Haciendo que la barra de controles para capturar cuadros se adapte al  tamaño del contenedor.", 
                "Quitando el header de la aplicación.", 
                "Reparando el paginador cuando la ventana cambia de tamaño.", 
                "Arreglos para hacer que el video se adapte al tamaño del contenedor. ", 
                "Habilitando la barra depuracion.", 
                "Posicionando el paginador de la linea de tiempo en una zona visible de  pantalla.", 
                "Commit inicial desde bitbucket.", 
                "Initial commit."
            ]
        }
    }
}